Домашняя_работа/src/DataProcessors/ЗагрузкаПрайслистаКонтрагента/ЗагрузкаПрайслистаКонтрагента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаПрайслистаКонтрагента</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Домашняя_работа/src/Documents/УстановкаЦен/УстановкаЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаЦен</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Согласовано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Цены</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.Сумма</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Домашняя_работа/src/DataProcessors/ЗагрузкаПрайслистаКонтрагента/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПроверитьПолныеправа() Тогда
		Элементы.СогласоватьЦены.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьПолныеправа()
	Возврат РольДоступна(Метаданные.Роли.ПолныеПрава);
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьФайлАсинх();
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗагрузитьФайлАсинх()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Текст = Новый ТекстовыйДокумент();
	Ждать Текст.ПрочитатьАсинх(Объект.ПутьКФайлу);
	Товары = Новый Массив;
	Для НомерСтроки = 1 По Текст.КоличествоСтрок() Цикл
		Товар = Новый Структура;
		Строка = Текст.ПолучитьСтроку(НомерСтроки);
		
		Разделеннастрока = СтрРазделить(Строка, ";");
		Товар.Вставить("Номенклатура", Разделеннастрока[0]);
		Товар.Вставить("Цена", Разделеннастрока[1]);
		Товары.Добавить(Товар);
	КонецЦикла;
	
	Если ПоискНоменклатуры(Товары) Тогда
		Ответы = Новый СписокЗначений();
		Ответы.Добавить("Не создавать документ");
		Ответы.Добавить("Не загружать цены");
		Ответы.Добавить("Создавать номенклатуру");
		ОтветНаВопрос = Ждать ВопросАсинх("Не все номенклатурные позиции из файла существуют в справочнике. Продолжить создание документа?", Ответы);
		Если ОтветНаВопрос = "Не создавать документ" Тогда
			Возврат;
		ИначеЕсли ОтветНаВопрос = "Не загружать цены" Тогда
			СоздатьДокумент(Объект.Контрагент, Товары, СогласоватьЦены);
		Иначе
			СоздатьДокумент(Объект.Контрагент, Товары, СогласоватьЦены, Истина);
		КонецЕсли;
	Иначе
		СоздатьДокумент(Объект.Контрагент, Товары, СогласоватьЦены);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоискНоменклатуры(Товары)
	ЕстьНеНайденные = Ложь;
	
	Для Каждого Товар Из Товары Цикл
		НайденнаяСсылка = Справочники.Номенклатура.НайтиПоНаименованию(Товар.Номенклатура);
		Если НайденнаяСсылка = Справочники.Номенклатура.ПустаяСсылка() Тогда
			ЕстьНеНайденные = Истина;
		КонецЕсли;
		Товар.Вставить("НоменклатураСсылка", НайденнаяСсылка)
		
	КонецЦикла;
	
	Возврат ЕстьНеНайденные;
КонецФункции

&НаСервереБезКонтекста
Процедура СоздатьДокумент(Контрагент, Товары, Согласовано, СоздаватьНоменклатуру = Ложь)
	
	Документ = Документы.УстановкаЦен.СоздатьДокумент();
	Документ.Контрагент = Контрагент;
	Документ.Дата = ТекущаяДата();
	Документ.Комментарий = "Загружен из файла";
	Документ.Согласовано = Согласовано;
	
	Для Каждого Товар Из Товары Цикл
		Если Справочники.Номенклатура.НайтиПоНаименованию(Товар.Номенклатура) = Справочники.Номенклатура.ПустаяСсылка() Тогда
			Если СоздаватьНоменклатуру Тогда
				НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
				НоваяНоменклатура.Наименование = Товар.Номенклатура;
				НоваяНоменклатура.Записать();
				Товар.НоменклатураСсылка = НоваяНоменклатура.Ссылка; 
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		НоваяЦена = Документ.Цены.Добавить();
		НоваяЦена.Номенклатура = Товар.НоменклатураСсылка;
		НоваяЦена.Цена = Число(Товар.Цена);
	КонецЦикла;
	
	Если Согласовано Тогда
		Документ.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		Документ.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьНоменклатуру(Товар)
	

	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ВыбратьФайлАсинх()
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыбратьФайлАсинх()
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбора.Фильтр = "csv-файлы|*.csv";
	ДиалогВыбора.Заголовок = "Выберите прайслист";
	ДиалогВыбора.МножественныйВыбор = Ложь;
	ДиалогВыбора.Каталог = "/mnt/480/workspace/1c/";
	
	Результат = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ПутьКФайлу = Результат[0];
	
КонецПроцедуры
